{
    "comment": "Generated by ChatGPT",
    "goals": [
        "Drink 8 glasses of water.",
        "Eat a serving of vegetables.",
        "Read for 15 minutes.",
        "Meditate for 5 minutes.",
        "Write a daily journal entry.",
        "Do a 5-minute workout.",
        "Call or text a friend.",
        "Practice a new skill for 10 minutes.",
        "Clean up your workspace.",
        "Make your bed.",
        "Tidy up a small area of your home.",
        "Plan your day.",
        "Spend 10 minutes learning something new online.",
        "Organize your to-do list.",
        "Take a 10-minute walk.",
        "Practice deep breathing exercises.",
        "Write down three things you’re grateful for.",
        "Review your goals for the week.",
        "Do a small act of kindness.",
        "Listen to a podcast or audiobook.",
        "Set a timer and focus on one task for 30 minutes.",
        "Practice a language for 10 minutes.",
        "Stretch for 5 minutes.",
        "Declutter a drawer or shelf.",
        "Drink a cup of tea or coffee mindfully.",
        "Make a healthy snack.",
        "Review and update your budget.",
        "Listen to your favorite song and enjoy it.",
        "Do a quick creative activity (doodle, write a haiku, etc.)",
        "Practice a relaxation technique.",
        "Spend 10 minutes on a hobby.",
        "Prepare a healthy meal.",
        "Write down a positive affirmation.",
        "Update your calendar or planner.",
        "Watch a motivational video.",
        "Follow up on a professional connection.",
        "Clean your phone screen.",
        "Review and prioritize your tasks for tomorrow.",
        "Do a short home workout.",
        "Check your mail and sort through it.",
        "Spend 10 minutes on a personal development book.",
        "Take a moment to appreciate nature.",
        "Practice a quick mindfulness exercise.",
        "Write a brief email to someone you admire.",
        "Clear out your email inbox.",
        "Plan a fun activity for the weekend.",
        "Cook or bake something new.",
        "Practice gratitude by writing a thank-you note.",
        "Set a small challenge for yourself and complete it.",
        "Check in on a family member or loved one.",
        "Refresh your workspace with a small decoration or plant.",
        "Set a small goal for the week and work towards it.",
        "Do a quick online course or tutorial.",
        "Organize your digital files.",
        "Listen to a new genre of music.",
        "Plan a simple, healthy meal for the next day.",
        "Review and reflect on your accomplishments for the day.",
        "Write down one thing you learned today.",
        "Revisit a past goal and assess your progress.",
        "Try a new exercise routine or stretch.",
        "Create a vision board or update it.",
        "Write a letter to your future self.",
        "Practice a quick relaxation or yoga pose.",
        "Review your long-term goals and adjust as needed.",
        "Do a quick digital detox (no screens for 30 minutes).",
        "Reorganize a small part of your home.",
        "Watch a TED talk or educational video.",
        "Write a short story or creative piece.",
        "Spend 10 minutes on a personal project.",
        "Check your progress on a habit tracker.",
        "Create a small art piece or craft.",
        "Write down a plan for tomorrow’s top tasks.",
        "Practice a short breathing exercise.",
        "Engage in a quick brain teaser or puzzle.",
        "Review your daily achievements and reward yourself.",
        "Engage in a short physical activity like dancing.",
        "Reflect on a positive experience from the day.",
        "Plan a mini celebration for a small achievement.",
        "Clean out your car or a small part of your home.",
        "Write a motivational quote and place it where you’ll see it.",
        "Set a small goal related to your career and work towards it.",
        "Engage in a quick, fun, creative project.",
        "Update or review your personal goals.",
        "Take a few minutes to relax and unwind before bed.",
        "Review a financial goal and take a small step towards it.",
        "Plan a quick outing or activity for the next day.",
        "Practice a new skill or hobby for 10 minutes.",
        "Do a quick inventory of your pantry or fridge.",
        "Check in with your mental health and journal about it.",
        "Organize a small area of your desk or workspace.",
        "Take a moment to appreciate your achievements today.",
        "Plan a small reward for yourself for the end of the week.",
        "Try a new recipe or food item.",
        "Connect with someone who inspires you.",
        "Spend a few minutes practicing positive visualization.",
        "Do a quick review of your goals and make adjustments.",
        "Practice a short mindfulness or gratitude exercise.",
        "Write a list of things you love about yourself.",
        "Engage in a small act of self-care.",
        "End your day with a positive thought or affirmation."
    ]
}